<template>
  <div class="landing">
    <div class="wrapWelcome">
      <Welcome
        :title="'Получайте стабильный поток клиентов'"
        :desc="
          'Всё просто, добавьте ваш объект недвижимости и принимайте запросы от гостей'
        "
        :image="'main-business.jpg'"
        :isClient="false"
      />
    </div>
    <div class="wrapHowWork">
      <HowWork
        :title="'Как это работает'"
        :list="[
          {
            image: 'howWork1.svg',
            title: 'Добавьте свой объек',
            desc:
              'Используя специальную форму, добавьте свой объект для размещения. Укажите название и категорию объекта. Добавьте описание и отметьте какие дополнительные удобства у вас есть. Загрузите фотографии.'
          },
          {
            image: 'howWork2.svg',
            title: 'Следите за статусом своего объекта',
            desc:
              'Выставляйте переключатель статуса своего объекта в положение свободен, если он сегодня готов для приёма гостей. В положение освобождается завтра или освобождается послезавтра, если он будет готов к приёму гостей завтра или послезавтра. В положение занят, если в ближайшие два дня он не будет свободен.'
          },
          {
            image: 'howWork3.svg',
            title: 'Принимайте гостей',
            desc:
              'Вам будут поступать запросы от гостей. В соответствии с деталями поездки гостей, укажите сумму, которую вы хотели бы получить чтобы принять этих гостей.'
          }
        ]"
      />
    </div>
    <div class="wrapOpportunity">
      <Opportunity
        :title="'Преимущества'"
        :list="[
          {
            id: 1,
            desc: 'Управлять рабочими процессами легко'
          },
          {
            id: 2,
            desc: 'Никаких календарей занятости'
          },
          {
            id: 3,
            desc: 'Не надо составлять тарифы и специальные предложения'
          },
          {
            id: 4,
            desc: 'Добавляйте объекты бесплатно'
          },
          {
            id: 5,
            desc: 'Вы будете видеть запросы от всех гостей'
          },
          {
            id: 6,
            desc: 'Сами выбираете себе гостей'
          }
        ]"
      />
    </div>
    <div class="wrapNewObject">
      <NewObject
        :newObj="{
          title: 'Давайте подготовим вас к приему гостей',
          dropDownList: [
            {
              id: 1,
              desc:
                'Выберите из предложенного списка категорию вашего объекта.',
              label: 'Категория жилья',
              list: ['Номер в гостинице', 'квартира', 'дом']
            },
            {
              id: 2,
              desc: 'Используя подсказки, укажите категорию номера.',
              label: 'Категория номера',
              list: ['Single', 'Double', 'Triple', 'Family Room']
            }
          ]
        }"
        :hintObj="{
          title: 'Подсказка',
          list: [
            {
              name: 'Single',
              desc:
                'Однокомнатный, для размещения одного отдыхающего. Спальное место одно.'
            },
            {
              name: 'Double',
              desc:
                'Однокомнатный номер для двоих. Может быть с одной большой кроватью или с двумя раздельными кроватями.'
            },
            {
              name: 'Triple',
              desc: 'Номер для троих отдыхающих.'
            },
            {
              name: 'Family Room',
              desc: 'Семейный двух- или трехкомнатный номер.'
            }
          ]
        }"
      />
    </div>
    <div class="wrapHistory">
      <History
        :title="'Несколько историй'"
        :list="[
          {
            id: 1,
            history:
              'В сервисе Restork вам не нужно устанавливать тарифы и расценки на проживание. Вам остаётся только выставить гостю в ответ на его запрос общую стоимость проживания.',
            author: {
              name: 'Константинов Константин',
              image: 'avatar.jpg'
            }
          },
          {
            id: 2,
            history:
              'Мы искренне верим что отдых может быть не дорогим и максимально подходящим для Вас по условиям проживания. В сервисе Restork вам не нужно устанавливать тарифы и расценки на проживание. Вам остаётся только выставить гостю в ответ на его запрос общую стоимость проживания.',
            author: {
              name: 'Константинов Константин',
              image: 'avatar.jpg'
            }
          },
          {
            id: 3,
            history:
              'Мы искренне верим что отдых может быть не дорогим и максимально подходящим для Вас по условиям проживания. В сервисе Restork вам не нужно устанавливать тарифы и расценки на проживание. Вам остаётся только выставить гостю в ответ на его запрос общую стоимость проживания.',
            author: {
              name: 'Константинов Константин',
              image: 'avatar.jpg'
            }
          },
          {
            id: 4,
            history:
              'Мы искренне верим что отдых может быть не дорогим и максимально подходящим для Вас по условиям проживания. В сервисе Restork вам не нужно устанавливать тарифы и расценки на проживание. Вам остаётся только выставить гостю в ответ на его запрос общую стоимость проживания.',
            author: {
              name: 'Павел Ястребов',
              image: 'avatar.jpg'
            }
          },
          {
            id: 5,
            history:
              'Мы искренне верим что отдых может быть не дорогим и максимально подходящим для Вас по условиям проживания. В сервисе Restork вам не нужно устанавливать тарифы и расценки на проживание. Вам остаётся только выставить гостю в ответ на его запрос общую стоимость проживания.',
            author: {
              name: 'Павел Ястребов',
              image: 'avatar.jpg'
            }
          }
        ]"
      />
    </div>
    <div class="wrapQuestion">
      <Question
        :title="'Частые вопросы'"
        :image="'question-image.svg'"
        :list="[
          {
            id: 1,
            req: 'Как установить стоимость моего жилья за ночь?',
            res:
              'В сервисе Restork вам не нужно устанавливать тарифы и расценки на проживание. Вам остаётся только выставить гостю в ответ на его запрос общую стоимость проживания.'
          },
          {
            id: 2,
            req: 'Сколько стоит опубликовать объявление?',
            res: 'Добавление объекта в систему не требует оплаты.'
          },
          {
            id: 3,
            req: 'Как получать запросы на проживание от гостей?',
            res:
              'Следите за статусом вашего жилья. Для приёма запросов от гостей в зависимости от занятости вашего объекта установите его в положение Свободен, Освобождается завтра или Освобождается послезавтра.'
          }
        ]"
      />
    </div>
  </div>
</template>
<script>
import Welcome from '~/components/Landing/Welcome'
import HowWork from '~/components/Landing/HowWork'
import Opportunity from '~/components/Landing/Opportunity'
import NewObject from '~/components/Landing/NewObject'
import History from '~/components/Landing/History'
import Question from '~/components/Landing/Question'
export default {
  layout: 'dashboardV2Fluid',
  components: { Welcome, HowWork, Opportunity, NewObject, History, Question }
}
</script>

<style lang="scss" scoped></style>
